Задача 1
Построить сводную таблицу с абсолютными доходимостями клиентов по месячным когортам.

Задача 2
Построить таблицу с клиентским Retention.

Задача 3
На основании Retention расчитать лайфтайм с помощью метода усредненных прямоугольников для каждой когорты.

Задача 4
Расчитать LTR для каждой когорты с помощью ARPU.

Предположите, что ARPU = 300.

Задача 5
Расчитать LTV с помощью усредненных костов для каждой когорты.

Задача 6
Сделать выводы относительно хороших и плохих когорт с точки зрения LTV.

Для этого выделить:

—  Когорту, которая показывает высокий LTV за счет высокого лайфтайма.
—  Когорту, которая показывает высокий LTV за счет низких костов.
—  Когорту, которая показывает низкий LTV за счет низкого лайфтайма.
—  Когорту, которая показывает низкий LTV за счет высоких костов.

Задача 7
Посчитать суммарную прибыль  компании по всем клиентам (за всё время).
На сколько процентов изменится суммарная прибыль, если увеличить ARPU на 10%?
